"""
                                    Циклы
"""
# for i in range(10):
#     print(f"привет {i}")

# for название переменной in range(количество повторений):
#     блок кода

"""
будет итерироваться 5 раз, будет 5 раз возводить в квадрат вводимое число
"""
# for i in range(5):
#     num = int(input())
#     print(f"квадрат вашего числа равен: {num * num}")
# print("цикл завершён")

"""
C и D выведет 5 раз
"""
# print("A")
# print("B")
#
# for i in range(5):
#     print("C")
#     print("D")
# print("E")

"""
C выведет 5 раз и потом D выведет 5 раз
"""
# print("A")
# print("B")
#
# for i in range(5):
#     print("C")
# for i in range(5):
#     print("D")
# print("E")

"""
выведет 10 раз привет
"""
# for i in range(10):
#     print(f"{i + 1} -- привет")

"""
выведет 5 раз в качестве переменной можно использовать нижнее подчёркивание ( _ )
"""
# for _ in range(5):
#     print(f"Python {_}")

"""
for, шаг
"""
# for(начало, конец, шаг)

# for i in range(3, 11, 2):
#     print(f"{i} - привет")

"""
переборка последовательности
"""
# word = input()
#
# for char in word:
#     print(char)

"""
черепашка
"""
# import turtle
#
# turtle.shape("turtle")
#
# for i in range(4):
#     turtle.forward(100)
#     turtle.right(90)
#
# turtle.done()

"""
длина текста
"""
# word = input()
#
# for i in range(len(word)):
#     print(i)
#     print(word[i])

"""
Задание 6
Удаление пробелов. Вывод строк с удалёнными пробелами
"""
# str_1 = input("введите строку: ")
# str_1 = str_1.split(" ")
# str_1 = "".join(str_1)
# print(str_1)

"""
Задание 7
Преобразование регистров. Вывод строк в верхнем регистре
"""
# str_2 = input("введите строку: ").upper()
# print(str_2)





