"""
----------------------------------------------------------------------------------------------------
                                        while
---------------------------------------------------------------------------------------------------
"""
#---------------------------------------------------------------------------------цикл while
# i = 0
# while i < 10:
#     print("привет")
#     i += 1

#----------------------------------------------------------------------------------бесконечный цикл
# while 1:
#     print("привет")


#---------------------------------------------------------------------------------бесконечный цикл
# num = int(input("введите число: "))
#
# while num != -1:
#     print(f"квадрат вашего числа равен {num * num}")
#     num = int(input("введите число: "))

#----------------------------------------------------------------------------------------break
# while True:
#     num = input()
#     if num == "stop":
#         break

#------------------------------------------------------------------------------бесконечный цикл
# ----------------- i не обновляется ------------------------ поэтому бесконечно
# i = 0
# total = 0
# while i < 10:
#     total += i
#     print(i)

#-----------------------------------------------------------------------------------------break
# result = 0 #проходит 10 циклов и суммирует
# #
# for i in range(10):
#     num = int(input("введите число: "))
#     if num < 0:
#         break
#     result += num
#
# print(result)

#---------------------------------------------------------------------содержит ли число цифру 7
# n = int(input())
# flag = False
#
# while n != 0:
#     last_digit = n % 10
#     if last_digit == 7:
#         flag = True
#         break
#     n //= 10
#
#     if flag == True:
#         print(f"Число {n} содержит цифру 7")
#     else:
#         print(f"Число {n} не содержит цифру 7")


#--------------------------------------------------------можно ли обойтись без континью
# for i in range(1, 101):
#     if i == 7 or i == 17 or i == 29 or i == 78:
#         continue
#     print(i)
#--------------------------собственно без--------------------------------------------
# for i in range(1, 101):
#     if i != 7 and i != 17 and i != 29 and i != 78:
#
#         print(i)

#--------------------------------------------------------------------else естественный выход
# a = 1
# while a < 5:
#     print("Условие верно!")
#     a = a + 1
# else:
#     print("Условие не верно!")

#--------------------------------------------------------------------------минуты и секунды
# for minutes in range(60):
#     for seconds in range(60):
#         print(minutes,':',seconds)

#-------------------------------------------------------------часы, минуты и секунды (сутки)
# for hours in range(24):
#     for minutes in range(60):
#         for seconds in range(60):
#             print(hours,':',minutes,':',seconds)

#---------------------------------------------------------------------------------------break
# for i in range(3):
#     for j in range(4):
#         if i == j:
#             break
#         print(i, j)
#------------------------------------------------------------------------------------continue
# for i in range(3):
#     for j in range(4):
#         if i == j:
#             continue
#         print(i, j)
#

#--------------------------------------------------------------------------------------break
# flag = False
#
# for i in range(3):
#     for j in range(3):
#         if (j==1) and (i==2):
#             flag = True
#             break
#         print(i, j)
#     if flag == True:
#         break

#--------------------------------------------------------------------------------------задачка
# numbers = [ 386, 462, 47, 418, 907, 344, 236, 375, 823, 566, 597, 978, 328, 615, 953, 345, 399, 162, 758, 219, 918, 237, 412, 566, 826, 248, 866, 950, 626, 949, 687, 217, ]
#
# for x in numbers:
#     if x == 237:
#         break
#     elif x % 2 == 0:
#         print(x)
















