"""
Звёздный треугольник
"""

# n = int(input())
#
# for i in range(n):
#     print("*" * n)
#     n -= 1
# #--------------------------
# n = int(input())
#
# for i in range(n):
#     print("*" * (n - i))
# #-------------------------
# n = int(input())
# [print('*' * i) for i in range(n, 0, -1)]

"""
Популяция 🦠
На вход программе подаются три натуральных числа m,p,n:
m: стартовое количество организмов;
p: среднесуточное увеличение в %;
n: количество дней для размножения.
Напишите программу, которая предсказывает размер популяции организмов 
с 1-го по n-й день (включительно). 
Программа должна выводить номер дня, а затем через пробел размер популяции в этот день.

Формат входных данных
На вход программе подаются три натуральных числа (каждое на отдельной строке): 
m,p,n.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Примечание. Задача решается через сложный процент.
"""
# m, p, n = float(input()), int(input()), int(input())
# p /= 100
#
# for i in range(n):
#     print(i + 1, m)
#     m += m * p

"""
звездочки
"""
# for i in range(5, 0, -1):
#     print("*" * i)
# print('Взлетаем!!!')

"""
Последовательность чисел 1
Даны два целых числа. Напишите программу, которая выводит все целые числа от 
m до n включительно.

Формат входных данных
На вход программе подаются два целых числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести числа в соответствии с условием задачи.
"""

# m, n = int(input()), int(input())
#
# for i in range(m, n + 1):
#     print(i)

# #----------------------------------------------------------------
# print(*range(int(input()), int(input()) + 1), sep='\n')

# #------------------------------------------------------------------
# [print(i) for i in range(int(input()), int(input()) + 1)]


"""
Последовательность чисел 2 🌶️
Даны два целых числа m и n. 
Напишите программу, которая выводит все целые числа от m до n включительно 
в порядке возрастания, если m < n, или в порядке убывания в противном случае.

Формат входных данных
На вход программе подаются два целых числа 
каждое на отдельной строке.

Формат выходных данных
Программа должна вывести числа в соответствии с условием задачи.
"""

# m, n = int(input()), int(input())
#
# if m < n:
#     for i in range(m, n + 1):
#         print(i)
# else:
#     for i in range(m, n - 1, -1):
#         print(i)

# #----------------------------------------
# m, n = int(input()), int(input())
# k = 1 - 2 * (m > n)                     #интересно
# for i in range(m, n + k, k):
#     print(i)

#-------------------------------------------
# m, n = int(input()), int(input())
# for i in range(m, n + 1) or range(m, n - 1, -1):
#     print(i)

#--------------------------------------------
# m, n = int(input()), int(input())
# print(*range(m, n + 1) if m < n else range(m, n - 1, -1), sep='\n')



"""
Последовательность чисел 3 🌶️
Даны два целых числа m и n (m>n)
Напишите программу, которая выводит все нечётные целые числа от m до n (включительно) 
в порядке убывания.

Формат входных данных
На вход программе подаются два целых числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести числа, каждое на отдельной строке, 
в соответствии с условием задачи.

Примечание. Попробуйте решить задачу двумя способами: 
с использованием условного оператора if и без него.
"""
# m, n = int(input()), int(input())
#
# for i in range(m, n - 1, -1):
#     if i % 2 != 0:
#         print(i)

# #--------------------------------------------------------
# m, n = int(input()), int(input())
#
# start = ((m - 1) // 2) * 2 + 1              #всегда будет нечётное
#
# for i in range(start, n - 1, -2):
#     print(i)

# #----------------------------------------------------------
# m, n = int(input()), int(input())
# for i in range(m - 1 + m % 2, n - 1, -2):       # m всегда нечётное
#     print(i)

# #-----------------------------------------------------------
# m, n = int(input()), int(input())
# for i in range(m, n, -2):
#     print(i - 1 + i % 2)

"""
Таблица умножения
"""
# x = int(input())
# for i in range(1, 10 + 1):
#     print(x, "x", i, "=", x * i)

# #-------------------------------------------------------------
# m=int(input())
# [print("{} x {} = {}".format(m,i,m*i)) for i in range(1,11)]

# #-------------------------------------------------------------
# (lambda n: [print(f'{n} x {i} = {n*i}') for i in range(1, 11)])(int(input()))

"""
Последовательность чисел 4
Даны два натуральных числа m и n (m≤n). Напишите программу, 
которая выводит все целые числа от m до n (включительно), 
удовлетворяющие хотя бы одному из условий:

число кратно 17
число оканчивается на 9
число кратно 3 и 5 одновременно
"""
# m, n = int(input()), int(input())
#
# for i in range(m, n + 1):
#     if i == 9 or i % 10 == 9:
#         print(i)
#     if i % 17 == 0:
#         print(i)
#     if i % 3 == 0 and i % 5 == 0:
#         print(i)

# #----------------------------------------------------
# m, n = int(input()), int(input())
#
# for i in range(m, n + 1):
#     if i % 17 == 0 or i % 10 == 9 or i % 15 == 0:
#         print(i)
# #------------------------------------------------------
# [print(_) for _ in range(int(input()), int(input())+1) if not _%17 or _%10==9 or not _%15]

#--------------------------------------------------------
# class SelectedNumber:
#
#     def __init__(self, value: int):
#         self.value = value
#
#     def is_multiple_17(self):
#         return self.value % 17 == 0
#
#     def is_endwith_9(self):
#         return str(self.value).endswith("9")
#
#     def is_multiple_3_and_5(self):
#         return self.value % 3 == self.value % 5 == 0
#
#
# m = int(input())
# n = int(input())
#
# for i in range(m, n + 1):
#     if any([SelectedNumber(i).is_multiple_17(),
#            SelectedNumber(i).is_endwith_9(),
#            SelectedNumber(i).is_multiple_3_and_5()]):
#         print(i)

#--------------------------------------------------------
# print(*filter(lambda x: x % 17 == 0 or  x % 10 == 9 or x % 15 == 0, range(int(input()), int(input())+1)), sep='\n')

"""
-----------------------------------------------------------------------------------------
Простое или составное число
-----------------------------------------------------------------------------------------
"""
# num = int(input())
# flag = True
#
# for i in range(2, num):
#     if num % i == 0:  #  если исходное число делится на какое-либо отличное от 1 и самого себя
#         flag = False
#
# if num == 1:
#     print('Это единица, она не простая и не составная')
# elif flag == True:
#     print('Число простое')
# else:
#     print('Число составное')

"""
----------------------------------------------------------------------------------------
Наибольшее число
----------------------------------------------------------------------------------------
"""
# largest = 0
# for _ in range(10):
#     num = int(input())
#     if num > largest:
#         largest = num
#
# print('Наибольшее число равно', largest)

#------------------------------------------------
# largest = int(input())  # принимаем первое число за максимальное
# for _ in range(9):
#     num = int(input())
#     if num > largest:
#         largest = num
#
# print('Наибольшее число равно', largest)

"""
----------------------------------------------------------------------------------------
Наименьшее число
----------------------------------------------------------------------------------------
"""
#----------------------------------------------------------
# largest = int(input())  # принимаем первое число за минимаьное
# for _ in range(9):
#     num = int(input())
#     if num < largest:
#         largest = num
#
# print('Наименьшее число равно', largest)

#---------------------------------------------------------------------------------
# total = 0
# for i in range(1, 6):
#     total += i
#     print(total, end='')
#---------------------------------------------------------------------------------

"""
---------------------------------------------------------------------------------
Количество чисел
На вход программе подаются два целых числа a и b (a≤b). 
Напишите программу, которая подсчитывает количество чисел в диапазоне от 
a до b (включительно), куб которых оканчивается на 4 или 9.

Формат входных данных
На вход программе подаются два целых числа a и b(a≤b).

Формат выходных данных
Программа должна вывести одно целое число в соответствии с условием задачи.

"""

# a, b = int(input()), int(input())
#
# counter = 0
#
# for i in range(a, b + 1):
#     if i**3 % 10 == 4 or i**3 % 10 == 9:
#         counter += 1
# print(counter)

# #-------------------------------------------------------
# a, b, count = int(input()), int(input()), 0
# for i in range(a, b + 1):
#     if i**3 % 10 in [4, 9]:             # список
#         count += 1
# print(count)

# #---------------------------------------------------------------
# print(sum([1 for i in range(int(input()), int(input())+1) if i**3%10 in [4,9]]))


"""
Сумма чисел
На вход программе подаются натуральное число n, а затем n целых чисел,
каждое на отдельной строке. Напишите программу, которая подсчитывает 
сумму введённых чисел (не включая само число n). 

"""

# n = int(input())
#
# count = 0
#
# for i in range(n):
#     count += int(input())
#
# print(count)

# #-----------------------------------------------------------------
#
# print(sum(int(input()) for _ in range(int(input()))))

#---------------------------------------------------------------------

"""
Асимптотическое приближение
"""

# from math import log
#
# result, n = 0, int(input())
#
# for i in range(1, n + 1):
#     result += (1 / i)
#
# print(result - log(n))

# #------------------------------------------------
# from math import log
#
# n = int(input())
#
# res = -log(n)                           # интересно
# for i in range(1, n + 1):
#     res += 1 / i
#
# print(res)

# #---------------------------------------------------
#
# from math import log
# n = int(input())
# print(sum(1 / i for i in range(1, n + 1)) - log(n))

# #------------------------------------------------------------------
# n = int(input())
# print(sum([1 / i for i in range(1, n + 1)]) - __import__("math").log(n))


"""
Сумма чисел 2
На вход программе подаётся натуральное число n. 
Напишите программу, которая подсчитывает сумму тех чисел от 1 до n (включительно), 
квадрат которых оканчивается на 2, 5 или 8.

"""

# res, n = 0, int(input())
#
# for i in range(1, n + 1):
#     if i**2 % 10 in [2, 5, 8]:
#         res += i
# print(res)

# #---------------------------------------------------
#
# print(5 * ((int(input())+5) // 10)**2)  # это математика


# #---------------------------------------------------
# print(sum([i for i in range(1,int(input())+1) if i**2 % 10 in [2,5,8]]))


"""
Факториал ❗
На вход программе подаётся натуральное число n. 
Напишите программу, которая вычисляет n!.
"""
# f, n = 1, int(input())
#
# for i in range(1, n + 1):
#     f *= i
#
# print(f)


# #-----------------------------------------------------
# from math import factorial
# print(factorial(int(input())))

#-------------------------------------------------------
# print(__import__('math').factorial(int(input())))

#-------------------------------------------------------

# fact = lambda n: 1 if n == 0 else n * fact(n - 1)
# print(fact(int(input())))



"""
Без нулей
Напишите программу, которая считывает 10 чисел и выводит произведение отличных от нуля чисел.

Формат входных данных
На вход программе подаются 10 целых чисел, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести произведение отличных от нуля чисел.

Примечание 1. Гарантируется, что хотя бы одно из 10 чисел является ненулевым.
Примечание 2. Отличные от нуля числа – те числа, которые не равны нулю.

"""
# count = 1
# for _ in range(10):
#     x = int(input())
#     if x != 0:
#         count *= x
#
# print(count)

# #------------------------------------------------------------------------------------------
# print(__import__("numpy").prod([i for i in [int(input()) for __ in range(10)] if i > 0]))

"""
Сумма делителей
На вход программе подаётся натуральное число n. 
Напишите программу, которая вычисляет сумму всех его делителей.
"""

# summ, n = 0, int(input())
#
# for i in range(1, n + 1):
#     if n % i == 0:
#         summ += i
# print(summ)

# #----------------------------------------------------------------------
# n = int(input())
# print(sum([i for i in range(1, n + 1) if n % i == 0]))

# #----------------------------------------------------------------------
# print((lambda n: sum([i for i in range(1, n + 1) if n % i == 0]))(int(input())))

"""
Знакочередующаяся сумма
На вход программе подаётся натуральное число n. 
Напишите программу вычисления знакочередующейся суммы:
"""

# summ, n = 0, int(input())
#
# for i in range(1, n + 1):
#     if i % 2:
#         summ += i
#     elif i % 2 == 0:
#         summ -= i
# print(summ)

# #------------------------------------------------------------
#
# n = int(input())
# print(sum([i * -1 for i in range(1, n + 1) if i % 2 == 0]) +
#       sum([i * 1 for i in range(1, n + 1) if i % 2]))

# #-------------------------------------------------------------
# n = int(input())
#
# f = 0
# for i in range(1, n + 1):
#     f += (-1) ** (i + 1) * i    # возводим в степень чёт нечёт
#
# print(f)

# #-------------------------- с фагом туда сюда---------------------
# n = int(input())
# total = 0
# flag = True
# for i in range(1, n + 1):
#     if flag == True:
#         total += i
#         flag = False
#     else:
#         total -= i
#         flag = True
# print(total)

# #------------------------------------на логику----------------------
# n = int(input())
#
# if n % 2 == 0:
#     print(-n // 2)
# else:
#     print(n // 2 + 1)

#------------------------------------------математика слева число справа знак
# n = int(input())
# print((n+1)//2 * (2*(n%2)-1))

"""
Наибольшие числа 🌶️🌶️
На вход программе подаются натуральное число n(n≥2), а затем n
различных натуральных чисел последовательности, каждое на отдельной строке. 
Напишите программу, которая выводит наибольшее и второе наибольшее число последовательности.
"""
# # n = int(input())
# # s = []
# # for _ in range(n):
# #     x = int(input())
# #     s.append(x)
# #
# # s.sort()
# #
# # print(s[n - 1])
# # print(s[n - 2])
#
#
# #------------------------------------------------- чисто математика
#
# n = int(input())
#
# max1, max2 = -1, -1
#
# for _ in range(n):
#     num = int(input())
#     if num > max1:
#         max2 = max1
#         max1 = num
#     elif num > max2:
#         max2 = num
#
# print(max1)
# print(max2)

#-----------------------------------------------------------------
# numbers = sorted([int(input()) for i in range(int(input()))])
# print(numbers[-1], numbers[-2], sep='\n')

#----------------------------------------------------------------
# print(*sorted(int(input()) for i in range(int(input())))[-2:][::-1], sep='\n')


"""
Only even numbers 🌶️
Напишите программу, которая считывает последовательность из 
10 целых чисел и определяет, является ли каждое из них чётным или нет.
"""

# count = 0
# for _ in range(10):
#     num = int(input())
#     if num % 2 == 0:
#         count += 1
#
# if count == 10:
#     print("YES")
# else:
#     print("NO")

# #----------------------------------------------------------------------
#
# count = sum([1 for _ in range(10) if int(input()) % 2 == 0])
# print("YES" if count == 10 else "NO")


"""
Последовательность Фибоначчи 🌶️
Напишите программу, которая считывает натуральное число n и выводит первые 
n чисел последовательности Фибоначчи.
"""
# n = int(input())
#
# x1, x2 = 1, 1
#
# for _ in range(n):
#     print(x1, end = " ")
#     x1, x2 = x2, x1 + x2







