"""
Ревью кода-1 🌶️🌶️
На обработку поступает последовательность из
10 целых чисел (каждое на отдельной строке).
Нужно написать программу, которая выводит на экран количество неотрицательных
чисел последовательности и их произведение. Если неотрицательных чисел нет,
требуется вывести на экран «NO» (без кавычек). Программист торопился и
написал программу неправильно.

Найдите все ошибки в этой программе (их ровно 4).
Известно, что каждая ошибка затрагивает только одну строку и может быть исправлена
без изменения других строк.

Примечание. При необходимости вы можете добавить необходимые строки кода
"""

# count = 0
# p = 1
#
# for i in range(1, 11):
#     x = int(input())
#     if x > -1:
#         p *= x
#         count += 1
#
# if count > 0:
#     print(count)
#     print(p)
# else:
#     print('NO')

#-------------------------------------ревью 2
# mx = -10000000000
# s = 0
# for i in range(10):
#     x = int(input())
#     if x < 0:
#         s += x
#         if x > mx:
#             mx = x
# if s == 0:
#     print("NO")
# else:
#     print(s)
#     print(mx)

#---------------------------------------
# s = 0
# for i in range(7):
#     n = int(input())
#     if n % 2 == 0:
#         s += n
# print(s)

#-----------------------------------------
# n = int(input())
# max_digit = -1
# while n > 0:
#     digit = n % 10
#     if digit % 3 == 0:
#         if digit > max_digit:
#             max_digit = digit
#     n //= 10
# if max_digit == -1:
#     print('NO')
# else:
#     print(max_digit)
#---------------------------------------------------
# n = int(input())
# while n >= 10:
#     n //= 10
# print(n)
#------------------------------------------------
# n = int(input())
# product = 1
# while n != 0:
#     digit = n % 10
#     product *= digit
#     n //= 10
# print(product)

















