"""
********************************************************************************
Задача

Первая задачка самая легкая - для разминки.

Необходимо найти уникальные значения product_id в таблице sales.

date_id	product_id	quantity
2025-01-01	123	4
2025-01-01	122	5
2025-01-01	123	8

product_id
122
123

___________________________________________________
select distinct product_id
from zadachi.sales;

SELECT product_id
FROM zadachi.sales
GROUP BY product_id;
********************************************************************************




"""