"""
-----------------------------------------------------------------------------------
упражнение №1 строки
------------------------------------------------------------------------------------
"""
"""
# сохраните имя пользоватея в переменной и выведите сообщение, предназначенное
# для конкретного человека. Сообщение должно быть простым, например:
# "Здаствуйте, Эрик, не хотите ли вы изучить Python сегодня?".
"""

# name = input("введите имя: ")
# print(f"Здраствуйте, {name}, не хотите ли вы изучить Python сегодня?")

"""
# сохраните имя пользоватея в переменной и выведите его в нижнем регистре,
# верхнем регистре и с капитализацией начальных букв каждого слова.
"""

# name = input("введите имя: ")

# print(f"Здраствуйте, {name}, не хотите ли вы изучить Python сегодня?".lower())
# print(f"Здраствуйте, {name}, не хотите ли вы изучить Python сегодня?".upper())
# print(f"Здраствуйте, {name}, не хотите ли вы изучить Python сегодня?".title())

"""
# выведите сообщение с ковычками, переносами и т.д.
"""

# print("""
# Альберт Энштейн сказал: "тот кто никогда не совершал ошибок, ни-
# когда не пробовал ничего нового".
# """)

"""
сохраните имя автора отдельно, сообщение отдельно и потом всё вместе выведите на экран
"""

# famous_person = "Альберт Энштейн"
# message = "тот кто никогда не совершал ошибок, никогда не пробовал ничего нового"
#
# print(f"""{famous_person} сказал: "{message}".""")

"""
удалите пробельные символы
"""

# name = "  вася  "
# print(name)
# print(name.lstrip())
# print(name.rstrip())
# print(name.strip())

"""
# использование функции removesuffix и removeprefix
"""

# name = "www.python_notes.txt"
# print(name)
# print(name.removesuffix(".txt"))
# print(name.removeprefix("www."))

