'''
знаки зодиака
'''
# day = int(input("введите день вашего рождения: "))
# month = int(input("введите месяц вашего рождения: "))
#
# if (month == 3 and day >= 21) or (month == 4 and day <= 19):
#     print("овен")
# elif (month == 4 and day >= 20) or (month == 5 and day <= 20):
#     print("телец")
# elif (month == 5 and day >= 21) or (month == 6 and day <= 20):
#     print("близнецы")
# elif (month == 6 and day >= 21) or (month == 7 and day <= 22):
#     print("рак")
# elif (month == 7 and day >= 23) or (month == 8 and day <= 22):
#     print("лев")
# elif (month == 8 and day >= 23) or (month == 9 and day <= 22):
#     print("дева")
# elif (month == 9 and day >= 23) or (month == 10 and day <= 22):
#     print("весы")
# elif (month == 10 and day >= 23) or (month == 11 and day <= 21):
#     print("скорпион")
# elif (month == 11 and day >= 22) or (month == 12 and day <= 22):
#     print("стрелец")
# elif (month == 12 and day >= 22) or (month == 1 and day <= 19):
#     print("козерог")
# elif (month == 1 and day >= 20) or (month == 2 and day <= 18):
#     print("водолей")
# elif (month == 2 and day >= 19) or (month == 3 and day <= 20):
#     print("рыбы")
# else:
#     print("неверно введены данные")

"""
---------------------------------------------------------------------------------------
пересып, недосып
---------------------------------------------------------------------------------------
"""
# a = int(input("введите сколько рекомендуется спать количество часов: "))
# b = int(input("введите сколько не рекомендуется спать количество часов: "))
# h = int(input("введите сколько количество часов Аня спит: "))
# if h <= b and h >= a:
#     print("Это нормально")
# elif h < a and h < b:
#     print("Недосып")
# elif h > b and h > a:
#     print("Пересып")

"""
----------------------------------------------------------------------------------------
фигуры
-----------------------------------------------------------------------------------------
"""
# import math
#
# a = int(input("введите сторону a: "))
# b = int(input("введите сторону b: "))
# c = int(input("введите сторону c: "))
# r = int(input("введите радиус r: "))
# f = input("введите фигуру ( треугольник ) или ( прямоугольник ) или ( круг ): ")
# p = (a + b + c) / 2
# s = p * (p - a) * (p - b) * (p - c)
# if f == "треугольник":
#     print(round(math.sqrt(s)))
# elif f == "прямоугольник":
#     print(a * b)
# elif f == "круг":
#     print(3.14 * (r * r))

"""
--------------------------------------------------------------------------------------
есть закономерность (до 1000 получается длинный код) прослонять программистов до 1000
--------------------------------------------------------------------------------------
"""
# while True:
#     s = int(input("введите количество программистов (от 0 до 1000) : "))
#     n1 = " программистов"
#     n2 = " программист"
#     n3 = " программиста"
#     if s >= 0:
#         if s == 0:
#             print(str(s) + n1)
#         elif s % 100 >= 10 and s % 100 <= 20:
#             print(str(s) + n1)
#         elif s % 10 == 1:
#             print(str(s) + n2)
#         elif s % 10 >= 2 and s % 10 <= 4:
#             print(str(s) + n3)
#         else:
#             print(str(s) + n1)

"""
-------------------------------------------------------------------------------------------
цвета
------------------------------------------------------------------------------------------
"""
# color = input("введите цвет например ( красный ) или ( синий ) или ( жёлтый ): ")
# color_mix = input("введите с каким цветом смешать например ( красный ) или ( синий ) или ( жёлтый ): ")
#
# if color == "красный" and color_mix == "красный":
#     print("красный")
# elif color == "красный" and color_mix == "синий" or color == "синий" and color_mix == "красный":
#     print("фиолетовый")
# elif color == "красный" and color_mix == "жёлтый" or color == "жёлтый" and color_mix == "красный":
#     print("оранжевый")
# elif color == "синий" and color_mix == "жёлтый" or color == "жёлтый" and color_mix == "синий":
#     print("зелёный")
# else:
#     print("ошибка")
"""
карманы пронумерованы от 0 до 36
0 - зелёный
с 1 - 10 (чётные - чёрный), (нечётные - красный)
с 11 - 18 (нечётные - чёрный), (чётные - красный)
с 19 - 28 (чётные - чёрный), (нечётные - красный)
с 29 - 36 нечётные - чёрный, чётные - красный
"""
# x = int(input("введите число от 0 до 36: "))
#
# if x == 0:
#     print(f"карман {x} - зелёный")
#
# elif (x >= 1 and x <= 10) and x % 2:
#     print(f"карман {x} - красный")
# elif (x >= 1 and x <= 10) and x % 2 == 0:
#     print(f"карман {x} - чёрный")
#
# elif (x >= 11 and x <= 18) and x % 2:
#     print(f"карман {x} - чёрный")
# elif (x >= 11 and x <= 18) and x % 2 == 0:
#     print(f"карман {x} - красный")
#
# elif (x >= 19 and x <= 28) and x % 2:
#     print(f"карман {x} - красный")
# elif (x >= 19 and x <= 28) and x % 2 == 0:
#     print(f"карман {x} - чёрный")
#
# elif (x >= 29 and x <= 36) and x % 2:
#     print(f"карман {x} - чёрный")
# elif (x >= 29 and x <= 36) and x % 2 == 0:
#     print(f"карман {x} - красный")
#
# else:
#     print("ошибка ввода")

"""
---------------------------------------------------------------------------------------------
Классификация треугольника
Описание: Напишите программу, которая запрашивает 
у пользователя длины трех сторон треугольника и определяет его тип.
Условия:
• Если все три стороны равны, выведите "Равносторонний".
• Если две стороны равны, выведите "Равнобедренный".
• Если все стороны разные, выведите "Разносторонний".
---------------------------------------------------------------------------------------------
"""
# length_1 = int(input("Введите длину первой стороны треугольника: "))
# length_2 = int(input("Введите длину второй стороны треугольника: "))
# length_3 = int(input("Введите длину третьей стороны треугольника: "))
# if length_1 == length_2 and length_1 == length_3:
#     print("Равносторонний")
# elif length_1 == length_2 or length_1 == length_3 or length_2 == length_3:
#     print("Равнобедренный")
# elif length_1 != length_2 and length_1 != length_3:
#     print("Разносторонний")











