"""
------------------------------------------------------------------------------------
                            КОРТЕЖИ неизменяемый тип данных
-----------------------------------------------------------------------------------
"""

                                    # tuple - тапл он же кортеж
# user_roles = ("admin", "editor", "viewer")
# print(user_roles)
# print(len(user_roles))
# for role in user_roles:
#     print(role)
# print("admin" in user_roles)
# print("wraiter" in user_roles)
# print(user_roles[0], user_roles[1], user_roles[2], sep=",")
# not_tuple = ("admin",)
# print(type(not_tuple)) #(tuple) - кортеж из одного элемента объявляется в конце (,)

# # распаковка кортежа, при распаковке количество элементов должно соответствовать
# #количеству тапла
# user_roles = ("admin", "editor", "viewer")
# role_1, role_2, role_3 = user_roles
# print(role_1)
# print(role_2)
# print(role_3)

# # что бы вывести два элемента у ненужного нужно поставить нижнее подчеркивание
# user_roles = ("admin", "editor", "viewer")
# role_1, role_2, _ = user_roles
# print(role_1)
# print(role_2)

"""
------------------------------------------------------------------------------------
                            КОРТЕЖИ самостоятельное выполнение
                            
-----------------------------------------------------------------------------------
"""
# #---------------------------------------------------<class 'tuple'>
# x = (9, 8, 7, 6)
#
# print(x)
# print(type(x))

# #-------------------------------------------------------------------int
# x = (9)
# print(type(x))
# #-----------------------------------------------------------а вот так 'tuple'
# x = (9,)
# print(type(x))

# #---------------------------------------------способы создания
# x = (9, 8, 7, 6)
# x1 = tuple("9876")
# print(x)
# print(x1)

# #------------------------------------------------
# x = (9, 8, 7, 6)
# print(x[0])


# #------------------------------------------------
# x = (9, 8, 7, 6)
#
# a, b, c, d = x
#
# print(a)
# print(b)
# print(c)
# print(d)

# #------------------------------------------------- обмен данными
#
# a = 5
# b = 2
#
# a, b = (b, a)
#
# print(a, b)      # будет 2 5

# #---------------------------------------------------распаковка
#
# x = (1,2,3,4,5,6,7,8,9,10)
#
# print(x[2:5]) #срез (3, 4, 5)

# #-----------------------------------------------------изменение данных
# x = [1,2,3,4,5,6,7,8,9,10]
#
# for i in range(len(x)):
#     x[i] += 3
#
# print(x)
# #--------------  а теперь кортеж
# x = (1,2,3,4,5,6,7,8,9,10)
# y = []
#
# for i in range(len(x)):
#     y.append(x[i] + 3)
#
# z = tuple(y)
#
# print(x)
# print(type(x))
# print(y)
# print(type(y))
# print(z)
# print(type(z))


# #----------------------------------------------замена элемента кортежа
# x = (1,2,3,4,5,6,7,8,9,10)
# print(x)
# t = list(x)
# t[0] = 10
# x = tuple(t)
# print(x)

# #-----------------------------------методы всего два не проверял пока по факту сколько
# x = (1,2,3,4,5,6,7,8,9,10)
# print(x.count(5))
#
# x = (1,2,3,4,5,6,7,8,9,10)    #выдает индекс первого встречного
# print(x.index(5))

# #-------------------------------------------------------не изменяем но добавить можно
#
x = (1,2,3,4,5,6,7,8,9,10)
y = x
x += (11,12)
print(x)
print(y)












