"""
-------------------------------------------------------------------------------------
начало, зацикливание, импорт рандом, счётчик
-------------------------------------------------------------------------------------
"""

#import random

# counter = 1
# while counter <= 5:
#     print(f"counter is: {counter}")
#     counter += 1
#
# counter = [1, 2, 3]
# while counter:
#     print(f"counter is: {counter}")
#     counter.pop()
# print(counter)

# while True:
#     x = input("введите число: ")
#     if x == "стоп":
#         break
#     print(f"вы ввели: {x}")

"""
--------------------------------------------------------------------------------------
                                цикл работы со строкой, контине
все данные будет выдавать до 5 раз букву (о) будет пропускать и не считать цикл
--------------------------------------------------------------------------------------
"""
# x = ""
#
# while len(x) < 5:
#     y = input("ввод данных: ")
#     if y == "o":
#         continue
#     x += y
# else:
#     print(x)

"""
-----------------------------------------------------------------------------------------
                                        зацикливание и брейк
-----------------------------------------------------------------------------------------
"""
# while True:
#     num_1 = int(input("введите число 1: "))
#     num_2 = int(input("введите число 2: "))
#
#     if num_1 > num_2:
#         print(num_2, num_1)
#     elif num_2 > num_1:
#         print(num_1, num_2)
#     else:
#         print("числа равны")
#         break

"""
----------------------------------------------------------------------------------------
ввод данных через цикл с заданным условием за один раз можно ввести больше
символов он не обрежет
----------------------------------------------------------------------------------------
"""
# x = ""
# while len(x) < 10:
#     y = input("введите данные не более 10 символов: ")
#     x += y
#
#     print(x)

"""
------------------------------------------------------------------------------------------
цикл для разбивки числа(123456) на строку(1,2,3,и т.д) и вывода в строку
выводит длину числа и его разбивает
------------------------------------------------------------------------------------------
"""
# n = int(input())
# length = 0
# while n > 0:
#     n //= 10  # это эквивалентно n = n // 10
#     length += 1
#     print(length, end=" ")

"""
---------------------------------------------------------------------------------------------------
использование else и break примеры
---------------------------------------------------------------------------------------------------
"""

# # -------------------------------------------------------------------------------------else
#
# i = 1
# while i < 5:
#     print("печатаю", i)
#     i += 1
#
# else:
#     print("цикл окончен")
#
# #---------------------------------------------break и else (проверить есть и отрицательные числа)
#
# x = int(input("введите: "))
#
# while x != 0:
#     if x < 0:
#         print("отрицательное")
#         break
#     x = int(input("введите: "))
# else:
#     print("нет отрицательных")

"""
--------------------------------------------------------------------------------------------------
                                                пример цикла
--------------------------------------------------------------------------------------------------
"""
# count = 5
#
# while count > 0:
#     print(f"цикл работает {count} раз")
#     count -= 1
#     print("цикл закончен")

"""
--------------------------------------------------------------------------------------------------
                    пример цикла (считает до нуля от заданного числа)
--------------------------------------------------------------------------------------------------
"""
# i = 0
# x = int(input("введите число: "))
# while i <= x:
#     print(f"{x - i}")
#     i += 1

"""
-------------------------------------------------------------------------------------------------
                            цикл выполняется хотя бы один раз
-------------------------------------------------------------------------------------------------
"""
# while True:
#     number = int(input("Enter a positive number: "))
#     print(number)
#     if not number > 0:
#         break

"""
---------------------------------------------------------------------------------------------
зацикливание и "stop"
---------------------------------------------------------------------------------------------
"""
# line = input("Type some text: ")
#
# while line != "stop":
#     print(line)
#     line = input("Type some text: ")

# ---------------------------------------------------------------короткий вариант
# while (line := input("Type some text: ")) != "stop":
#     print(line)




