"""
---------------------------------------------------------------------------------
программисты считают с нуля
---------------------------------------------------------------------------------
"""
# #индексы считаются с (0) слева на право (начало строки),
# # и от (-1) справа на лево (конец строки)
# fruits = ["apple", "banana", "cherry", "watermelon"]
# print((fruits[0]))
# print((fruits[-4]))

"""
--------------------------------------------------------------------------------------
присвоение через индекс
--------------------------------------------------------------------------------------
"""
# fruits = ["apple", "banana", "cherry", "watermelon"]
# fruits[0] = "gold"
# print(fruits)

"""
-------------------------------------------------------------------------------------
перестановка через индекс
-------------------------------------------------------------------------------------
"""
# fruits = ["apple", "banana", "cherry", "watermelon"]
# print(fruits)
# fruits[0], fruits[3] = fruits[3], fruits[0]
# fruits[1], fruits[2] = fruits[2], fruits[1]
# print(fruits)

"""
-----------------------------------------------------------------------------------
срезы (выборка)
срезы открытое значение первое возвращается, закрывающийся элемент нет,
нужно взять на индекс больше (смотри ниже)
----------------------------------------------------------------------------------
"""
# my_numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# print(my_numbers)
# print(my_numbers[0:5]) #выбирает от (0) по индексу (5) индекс не входит в список
# #можно создать новую переменную и закинуть туда список
# new_numb = (my_numbers[0:5])
# print(new_numb)

"""
-------------------------------------------------------------------------------------
список по длине
-------------------------------------------------------------------------------------
"""
# my_numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# new_numb = my_numbers [0:len(my_numbers )] #возвращает список по длине
# print(new_numb)
# new_numb = my_numbers [:] #возвращает список по длине (сокращённая запись)
# print(new_numb)
# new_numb = my_numbers [:5] #первые пять элементов
# print(new_numb)
# new_numb = my_numbers [0:10:2] #шаг, каждый второй элементов из десяти
# print(new_numb)
# new_numb = my_numbers [::2] #аналогично
# print(new_numb)
# new_numb = my_numbers [::-1] #разворот списка с помощью слайса
# print(new_numb)

"""
---------------------------------------------------------------------------------------
пример со строками
---------------------------------------------------------------------------------------
"""
# my_string = "hello world"
# print(my_string)
# my_string1 = my_string [::2]
# print(my_string1)
# my_string2 = my_string [::-1]
# print(my_string2)
# # и т.д.

"""
-----------------------------------------------------------------------------------------
три способа разворота (list)
-----------------------------------------------------------------------------------------
"""
# my_numbers_1 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# my_numbers_1_1 = my_numbers_1[::-1]
# print(my_numbers_1_1)

# my_numbers_1_2 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# my_numbers_1_2.reverse()
# my_numbers_2 = my_numbers_1_2
# print(my_numbers_2)

# #функцию (reversed) необходимо обернуть в (list)
# my_numbers_1_3 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# my_numbers_3 = list(reversed(my_numbers_1_3))
# print(my_numbers_3)