"""
------------------------------------------------------------------------------------------------
переборка циклом (включая длины и т.д.)
------------------------------------------------------------------------------------------------
"""
# people = ['John', 'Paul', 'Sara', 'Susan']
#
# # Simple for loop
# for person in people:
#   print(f'Current Person: {person}')
#
# # Break
# for person in people:
#   if person == 'Sara':
#     break
#   print(f'Current Person: {person}')
#
# # Continue
# for person in people:
#   if person == 'Sara':
#     continue
#   print(f'Current Person: {person}')
#
# # range
# for i in range(len(people)):
#   print(i, people[i])
#
# for i in range(0, 11):
#   print(f'Number: {i}')
#
# # While loops execute a set of statements as long as a condition is true.
#
# count = 0
# while count < 10:
#   print(f'Count: {count}')
#   count += 1

"""
-------------------------------------------------------------------------------------
Циклы, каждый цикл это итерация
перебрать список
-------------------------------------------------------------------------------------
"""
# file_name1 = ["doc.txt", "im.jpg", "doc2.txt", "im2.jpg",]
# for file_name_1 in file_name1[0]:
#
#     print(file_name_1)
"""
---------------------------------------------------------------------------------------
перебрать строку
---------------------------------------------------------------------------------------
"""
# file_name2 = "doc.txt"
# for file_name_2 in file_name2:
#     print(file_name_2)

"""
---------------------------------------------------------------------------------------
перебрать элемент в списке
---------------------------------------------------------------------------------------
"""
# file_name3 = ["doc.txt", "im.jpg", "doc2.txt", "im2.jpg", ]
# for file_name_3 in file_name3[0]:
#     print(file_name_3)

"""
----------------------------------------------------------------------------------------
вернуть в терминал нужный символ
----------------------------------------------------------------------------------------
"""
# string_1 = "hello world"
# count_l = 0
# for string_1_1 in string_1:
#     if string_1_1 == "o":
#         count_l += 1
#         print(string_1_1)
# print(count_l)

"""
--------------------------------------------------------------------------------------
вложенные циклы
--------------------------------------------------------------------------------------
"""
# student1 = ["alice", "bob", "david"]
# for student_1 in student1:
#     print(student_1)
#     for student_1_1 in student_1:
#         print(student_1_1)

"""
-----------------------------------------------------------------------------------------
континью и брейк (пример вывод чётных чисел)
----------------------------------------------------------------------------------------
"""
# num_1 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# for num_1_1 in num_1:
#     if num_1_1 % 2:
#         continue
#     print(num_1_1)

# num_2 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# for num_2_1 in num_2:
#     if num_2_1 == 2:
#         break
#     print(num_2_1)

"""
---------------------------------------------------------------------------------------
range
---------------------------------------------------------------------------------------
"""
# range_1 = range(11)
# print(range_1)
# numbers_1 = list(range_1)
# print(numbers_1)

# range_2 = range(2, 8)
# print(range_2)
# numbers_2 = list(range_2)
# print(numbers_2)

"""
-----------------------------------------------------------------------------------
шаг
-----------------------------------------------------------------------------------
"""
# range_3 = range(2, 8, 2)
# print(range_3)
# numbers_3 = list(range_3)
# print(numbers_3)

"""
--------------------------------------------------------------------------
шаг
--------------------------------------------------------------------------
"""
# range_4 = range(10, 0, -2)
# print(range_4)
# numbers_4 = list(range_4)
# print(numbers_4)

"""
-----------------------------------------------------------------------------------
добавить (+1)  числам в список через (range) используя длину через (i)
-----------------------------------------------------------------------------------
"""
# num_3 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# print(num_3)
# for i in range(len(num_3)):
#     num_3[i] += 1
# print(num_3)

"""
-----------------------------------------------------------------------------------
Задача определить наличие символа, количество и по какому индексу находится
-----------------------------------------------------------------------------------
"""
# string_2 = "hello world"
#
# ind_1 =[]
# count = 0
#
# for i in range(len(string_2)):
#     if string_2[i] == "l":
#         count += 1
#         ind_1.append(i)
# print(count)
# print(ind_1)

"""
----------------------------------------------------------------------------------------
таблица умножения
----------------------------------------------------------------------------------------
"""
#------------------------вариант генератор

# [[print(f'{j} * {i} = {j*i}') for i in range(1, 10)]and print() for j in range(1, 10)]

# # вариант 1
# for i in range(1, 10):
#     for j in range(1, 10):
#         print(i, "*", j, "=", i * j)
#     print()
# # вариант 2
# for i in range(1, 10):
#     for j in range(1, 10):
#         print("%4d" % (i * j), end="")
#     print()
# # вариант 3
# for i in range(1, 10):
#     print("\nтаблица умножения на ", i)
#     for j in range(1, 10):
#         print(f" {i} * {j} = {i * j}")

# print("\n\t\t\t\t\t\t\t\t\t\tтаблица умножения\n")
# for i in range(1, 10):
#     for j in range(1, 10):
#         print(j, "*", i, "=", j * i, end="\t")
#     print()

"""
---------------------------------------------------------------------------------
поиск, закидывание в []
--------------------------------------------------------------------------------
"""
# n = list(range(10))
# m = []
#
# for i in n:
#     if i == 8:
#         continue
#     m += [i]
#
# print(m)

"""
---------------------------------------------------------------------------------------
перебирает letters и в str_1 = '' возвращает символы с нижним регистром
---------------------------------------------------------------------------------------
"""
# letters = 'ЫгВЫоЯСремДШНККАыкЩЙФа'
# str_1 = ''
# for i in letters:
#     if not i.isupper():
#         str_1 += i
#
# print(str_1)

"""
-------------------------------------------------------------------------------------
красивый алфавит
-------------------------------------------------------------------------------------
"""
# rus_lower = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'
# for position in range(11):
#     print('^' * 18)
#     for letter in rus_lower:
#         if rus_lower.index(letter) % 11 == position:
#             print('|', letter.upper(), letter, end='|')
#     print()
# print('^' * 18)

"""
------------------------------------------------------------------------------------
проверка является ли число простым через цикл (бред)
------------------------------------------------------------------------------------
"""
# x = 31
# i = 2
# for i in range(i, x):
#     if x % i == 0:
#         print(f"{x} - простое")
#         break
#     else:
#         print(f"{x} - не простое")
#         break

"""
--------------------------------------------------------------------------------------
работа со словарём
--------------------------------------------------------------------------------------
"""
# dt = {'a': 'Фрукты', 'b': 'Яблоки', 'c': 'Груши'}
#
# for key, value in dt.items():
#     print(key, value)
# print(type(key))
#
# for key in dt:
#     print(key)
# print(type(key))
#
# for key in dt.items():
#     print(key)
# print(type(key))

"""
-------------------------------------------------------------------------------------------------
Изменить текст таким образом, чтобы каждое предложение начиналось с большой буквы;
+Посчитайте сколько раз цифры встречаются в тексте;
+ Посчитайте сколько раз знаки препинания встречаются в тексте;
+ Посчитайте количество восклицательных знаков в тексте.
-------------------------------------------------------------------------------------------------
"""
# txt = input("""изменить, текст1!. таким - образом2. чтобы каждое, предложение3. начиналось с большой буквы4!!!: \n""").capitalize() + "  "
# zn = ["!", ".", ",", "?", ":", ";", "-"]
# count = 0
# count1 = 0
# count2 = 0
#
# for i in txt:
#     if i == "!":
#         count += 1
#     if i.isdigit():
#         count1 += 1
#     for z in zn:
#         if z == i:
#             count2 += 1
#
# print(f"восклицательных знаков = {count}")
# print(f"количество цифр = {count1}")
# print(f"количество знаков препинания = {count2}")
#
# lst = (list(txt))
# vr = []
#
# for index, i in enumerate(lst):
#     if i == ".":
#         vr.append(index + 2)
#     if i == "!":
#         vr.append(index + 2)
#     if i == "?":
#         vr.append(index + 2)
#
# for j in vr:
#     lst[int(j)] = lst[int(j)].upper()
#
# print("".join(lst))
