"""
-------------------------------------------------------------------------------------
словарь (dict) ключ, значение
-------------------------------------------------------------------------------------
"""
# person = {
#     "name": "John",
#     "age": 30,
#     "city": "New York"
# }
# print(person)

#--------------------------------------------------------------------------присваивание
# person["job"] = "Engineer"
# print(person)

#--------------------------------------------------------другой способ объявления словаря
# person = {}
# person["name"] = "John"
# person["age"] = 30
# person["city"] = "New York"
# print(person)

#--------------------------------------------------------------------------вызов значения
# person = {
#     "name": "John",
#     "age": 30,
#     "city": "New York"
# }
# print(person["name"], person["age"], person["city"] )

#-----------------------------------------избежание ошибки при запросе несуществующего ключа
# # print(person["country"]) #выдаст ошибку
# print(person.get("country")) # а так нет, вернёт (None)
# #дефолтное значение
# print(person.get("country", "USA")) # а так нет, вернёт (USA)
# print(person.get("name", "USA")) # а так нет, вернёт истинное (John)

"""
-----------------------------------------------------------------------------------------
распаковка
----------------------------------------------------------------------------------------
"""
#-----------------------------------------------итерации с распаковкой (раскоментируй персон)
# person = {
#     "name": "John",
#     "age": 30,
#     "city": "New York"
# }

#-------------------------------------вариант(здесь можно по отдельности и ключ и значение)
# for item in person.items():
#     key, value = item
#     print(item)
#     print(key)
#     print(value)
#     print(type(item))

#----------------------------------------------------------------------------------другой
# for key, value in person.items():
#     print(key)
#     print(value)

#----------------------------------------------------------------итерация по ключам
# for key in person.keys():
#     print(key)
#---------------------------------------------------------------итерация по значению
# for value in person.values():
#     print(value)

#                             #сравнение словарей
# person = {
#     "name": "John",
#     "age": 30,
#     "city": "New York"
# }
# other_person = {
#     "city": "New York",
#     "age": 30,
#     "name": "John"
# }
# print(person == other_person)
# #вернётся тру словари сравниваются по ключам и значениям порядок не важен
# # если изменится значение или ключ у одного словаря вернётся фолс
# # если в какой либо словарь добавится пара вернётся фолс

#                             #объединение словарей(частотная задача)
# person = {
#     "name": "John",
#     "age": 30,
#     "city": "New York"
# }
# additional_person_info = {
#     "job": "Engineer",
#     "married": True,
#     "city": "London"
# }
# #объединение с обновлением
# person.update(additional_person_info)
# #другой способ
# person = person | additional_person_info
# print(person)

"""
--------------------------------------------------------------------------------------
работа со словарём
--------------------------------------------------------------------------------------
"""
# dt = {'a': 'Фрукты', 'b': 'Яблоки', 'c': 'Груши'}
#
# for key, value in dt.items():
#     print(key, value)
# print(type(key))
#
# for key in dt:
#     print(key)
# print(type(key))
#
# for key in dt.items():
#     print(key)
# print(type(key))





