
"""
Задание 1
Установите и настройте на своем локальном компьютере Git.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 2
Создайте папку с двумя подпапками. В каждой подпапке добавьте несколько файлов.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 3
Создайте репозиторий в главной папке.
(git init)
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 4
Добавьте содержимое двух подпапок в индекс репозитория с помощью команды: git add .
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 5
Создайте commit на основании подпапок, добавленных в индекс.
Используйте команду: git commit -m "описание...".
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 6
Измените содержимое одного из файлов в подпапке и создайте commit с новым данными.
git add "путь к файлу"
git commit -m "описание..."
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 7
Создайте новую подпапку, наполните её данными. После этого создайте commit c содержимым
новой подпапки.
-----
сначала git add "название папки"
потом git commit -m "описание..."
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 8
Внесите изменения в содержимое файла в новой подпапке,
сохраните изменения (не создавайте новый commit).
Отмените изменения в локальной копии файла с помощью команды: git checkout
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


Задание 9
Внесите изменения в содержимое файла в новой подпапке,
добавьте изменения в индекс (не создавайте новый commit).
Отмените изменения в индексе с помощью команды: git reset
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


Задание 10:
Внесите изменения в содержимое файла в новой подпапке, добавьте изменения в индекс,
создайте новый commit.
Отмените изменения в последнем commit путем создания
нового commit с помощью команды: git revert.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 11
Удалите несколько последних commit. Используйте
команду: git reset с опцией --hard.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


Задание 12
Внесите изменения в последний commit не создавая
нового. Используйте: git commit с ключом --amend.
<<<<<<<< HEAD:дом.задание_1/задания.py
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
"""

"""
>>>>>>>> 2d7937d348b5b8197776a1bf1f5898e05464d36a:дом.задание_1/дом.задание_1.py
=======
"""
"""
Задание 1
Установите и настройте на своем локальном компьютере Git.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 2
Создайте папку с двумя подпапками. В каждой подпапке добавьте несколько файлов.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 3
Создайте репозиторий в главной папке.
(git init)
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 4
Добавьте содержимое двух подпапок в индекс репозитория с помощью команды: git add .
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 5
Создайте commit на основании подпапок, добавленных в индекс.
Используйте команду: git commit -m "описание...".
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 6
Измените содержимое одного из файлов в подпапке и создайте commit с новым данными.
git add "путь к файлу"
git commit -m "описание..."
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 7
Создайте новую подпапку, наполните её данными. После этого создайте commit c содержимым
новой подпапки.
-----
сначала git add "название папки"
потом git commit -m "описание..."
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 8
Внесите изменения в содержимое файла в новой подпапке,
сохраните изменения (не создавайте новый commit).
Отмените изменения в локальной копии файла с помощью команды: git checkout
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


Задание 9
Внесите изменения в содержимое файла в новой подпапке,
добавьте изменения в индекс (не создавайте новый commit).
Отмените изменения в индексе с помощью команды: git reset
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


Задание 10:
Внесите изменения в содержимое файла в новой подпапке, добавьте изменения в индекс,
создайте новый commit.
Отмените изменения в последнем commit путем создания
нового commit с помощью команды: git revert.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 11
Удалите несколько последних commit. Используйте
команду: git reset с опцией --hard.
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Задание 12
Внесите изменения в последний commit не создавая
нового. Используйте: git commit с ключом --amend.
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
>>>>>>> 2d7937d348b5b8197776a1bf1f5898e05464d36a
"""

