'''
---------------------------------------------------------------------------------
                                         факториал
-------------------------------------------------------------------------------------
'''
# x = int(input("введите число для подсчёта факториала: "))
# count = 0
# y = 1
# while count < x:
#     count += 1
#     y *= count
# print(f"факториал ({x}) равен ( {y} )")
#------------------------------------------------------------простой вариант
# i = 5
# f = 1
# while i > 1:
#     f *= i
#     i -= 1
# print(f)

'''
------------------------------------------------------------------------------------
                        цикл постоянного запуска программы и брейк
------------------------------------------------------------------------------------
'''
# while True:
#     x = int(input("введите число для подсчёта факториала: "))
#     count = 0
#     y = 1
#     while count < x:
#         count += 1
#         y *= count
#     if x == 0:
#         break
#     else:
#         print(y)

'''
---------------------------------------------------------------------------------
                     факториал в заданном пользователем.
---------------------------------------------------------------------------------
'''
# start = int(input("введите начало диапазона: "))
# end = int(input("введите конец диапазона: "))
#
# count = start
# y = 1
# while count < end:
#     count += 1
#     y *= count
# print(f"факториал диапазоа от ({start} до {end}) равен ( {y} )")


'''
---------------------------------------------------------------------------------
                             определение шестизначности числа
---------------------------------------------------------------------------------
'''
# dl = input("введите шестизначное число: ")
#
# if len(dl) == 6:
#     print("ok")
# else:
#     print("ошибка")

'''
 -------------------------------------------------------------------------------
    Запросить 2 числа и найти только наибольший общий делитель (алгоритм Евклида).
--------------------------------------------------------------------------------
'''
# a = int(input("введите первое число: "))
# b = int(input("введите второе число: "))
#
# while a != 0 and b != 0:
#     if a > b:
#         a = a % b
#         print("a = ", a)
#     else:
#         b = b % a
#         print("b = ", b)
# print(f"наибольший делитель {a + b}")

'''
-----------------------------------------------------------------------------------
Запросить у пользователя число и вывести все делители этого числа.
----------------------------------------------------------------------------------
'''
# x = int(input("введите число: "))
# y = 1
# # d = [] # дополнение
# while y <= x:
#     if x % y == 0:
#         print(y, end="; ")
# # дополнение
# #         d.append(y)
# #     y = y + 1
# # print(d)

"""
цикл будет пока сумма не достигнет x < 5
"""
# x = 0
#
# while x < 5:
#     y = int(input("ввод данных: "))
#     if y == 0:
#         continue
#     x += y
#
#     print(x)

"""
------------------------------------------------------------------------------------
последовательность фибоначчи
------------------------------------------------------------------------------------
"""
# x = int(input("Количество последовательностей "))
#
# n1, n2 = 0, 1
# count = 0

# print("Последовательность Фибоначчи:")
# while count < x:
#     n3 = n1 + n2
#     n1 = n2
#     n2 = n3
#     count += 1
#     print(n1)

"""
------------------------------------------------------------------------------------
проверка является ли число простым через цикл
------------------------------------------------------------------------------------
"""
# x = 30
# i = 2
# while i < x:
#     if x % i == 0:
#         print(f"{x} - простое")
#         break
#     else:
#         print(f"{x} - не простое")
#         break

"""
------------------------------------------------------------------------------------------------
                                        таблица умножения
------------------------------------------------------------------------------------------------
"""
# i = 1
# while i < 10:
#     j = 1
#     while j < 10:
#         print(f"{i} * {j} = {j * i}")
#         j += 1
#     i += 1

"""
------------------------------------------------------------------------------------------------
                            таблица умножения на заданное число
------------------------------------------------------------------------------------------------
"""
# i = 1
# x = int(input("введите число: "))
#
# while i <= 10:
#     print(f"{x} * {i} = {x * i}")
#     i += 1

"""
------------------------------------------------------------------------------------------------
            делёж пирога (в одной команде "a" человек в другой "b" поделить поровну
            (по идее наименьший делитель)
------------------------------------------------------------------------------------------------
"""
# a = int(input("число 1: "))
# b = int(input("число 2: "))
#
# d = 1
#
# while d % a or d % b:
#     d += 1
# print(d)

"""
---------------------------------------------------------------------------------------------
                                    проверка пароля через цикл
---------------------------------------------------------------------------------------------
"""
# MAX_ATTEMPTS = 3
#
# correct_password = "secret123"
# attempts = 0
#
# while True:
#     password = input("Password: ").strip()
#     attempts += 1
#
#     if password == correct_password:
#         print("Login successful! Welcome!")
#         break
#
#     if attempts >= MAX_ATTEMPTS:
#         print("Too many failed attempts.")
#         break
#     else:
#         print(f"Incorrect password. {MAX_ATTEMPTS - attempts} attempts left.")

"""
--------------------------------------------------------------------------------------------
                угадай число(смотри в играх ещё есть версия)
--------------------------------------------------------------------------------------------
"""
# from random import randint
#
# LOW, HIGH = 1, 10
#
# secret_number = randint(LOW, HIGH)
# clue = ""
#
# # Game loop
# while True:
#     guess = input(f"Guess a number between {LOW} and {HIGH} {clue} ")
#     number = int(guess)
#     if number > secret_number:
#         clue = f"(less than {number})"
#     elif number < secret_number:
#         clue = f"(greater than {number})"
#     else:
#         break
#
# print(f"You guessed it! The secret number is {number}")
"""
------------------------------------------------------------------------------------------------
Напишите программу, которая запрашивает два целых числа x и y, после чего вычисляет и выводит
значение x в степени y.
------------------------------------------------------------------------------------------------
"""
# x = int(input("введите число ( х ) : "))
# y = int(input("введите ( у ): "))
#
# i = 1
# z = 0           # необязательная переменная
#
# while i <= y:
#     z = x ** i
#     i += 1
#
# print(f"{x} ** {y} = {z}","\n")

"""
------------------------------------------------------------------------------------------------------
Подсчитать количество целых чисел в диапазоне от 100 до 999 у которых есть две одинаковые цифры.
------------------------------------------------------------------------------------------------------
"""
# a = 100
# b = 999
# count = 0
#
# while a <= b:
#     a += 1
#     y = list(str(a))
#
#     if y[0] == y[1] or y[0] == y[2] or y[1] == y[2]:
#         count += 1
#
# print(f"целых чисел в диапазоне от ( 100 ) до ( 999 ) где есть по две одинаковые цифры равно: {count}","\n")
#
#
# # #------вариант с использованием длины, множества, оператора сравнения и цикла
# # count1 = 0
# # for num in range(100, 1000):
# #    if len(set(str(num))) != len(str(num)):
# #         count1 += 1
# # print(f"целых чисел в диапазоне от ( 100 ) до ( 999 ) где есть по две одинаковые цифры равно: {count1}")

"""
-----------------------------------------------------------------------------------------------------
Подсчитать количество целых чисел в диапазоне от 100 до 9999 у которых все цифры разные.
-----------------------------------------------------------------------------------------------------
"""
# a = 100
# b = 10000
#
# count = 0
#
# for i in range(a, b):
#     y = list(str(i))
#     if len(y) == 3:
#         if y[0] != y[1] and y[0] != y[2] and y[1] != y[2]:
#             count += 1
#
#     if len(y) == 4:
#         if y[0] != y[1] and y[0] != y[2] and y[0] != y[3] and y[1] != y[2] and y[1] != y[3] and y[2] != y[3]:
#             count += 1
#
# print (f"количество целых чисел в диапазоне от ( {a} ) до ( {b - 1} ) у которых все цифры разные = {count}","\n")
#
# # #------вариант с использованием длины, множества, оператора сравнения и цикла
# # count2 = 0
# # for num in range(100, 10000):
# #    if len(set(str(num))) == len(str(num)):
# #         count2 += 1
# # print(f"количество целых чисел в диапазоне от ( 100 ) до ( 9999 ) у которых есть все разные цифры = {count2}")

"""
---------------------------------------------------------------------------------------------------------
Пользователь вводит любое целое число. Необходимо из этого целого числа удалить все цифры 3 и 6 и
вывести обратно на экран.
--------------------------------------------------------------------------------------------------------
"""
# x = input("введите многозначное число например ( 12345678 ): ")
# y = list(x)
#
# for i in y:
#     if i == "3" or i == "6":
#         continue
#
#     print(i, end="")

"""
-------------------------------------------------------------------------------------------------------
Пользователь вводит с клавиатуры числа. Если число больше нуля нужно вывести 
надпись «Number is positive», если меньше нуля «Number is negative», 
если равно нулю «Number is equal to zero». Когда пользователь вводит
число 7 программа прекращает работу и выводит на экран надпись «Good bye!»
-------------------------------------------------------------------------------------------------------
"""
# while True:
#     x = int(input("введите число: "))
#     if x > 0 and x != 7:
#         print("Number is positive")
#     elif x < 0:
#         print("Number is negative")
#     elif x == 0:
#         print("Number is equal to zero")
#     elif x == 7:
#         print("Good bye!")
#         break

"""
-------------------------------------------------------------------------------------------------------
Пользователь вводит с клавиатуры числа. Программа должна подсчитывать сумму, максимум и минимум,
введенных чисел. Когда пользователь вводит число 7 программа прекращает свою работу и выводит на экран
надпись «Good bye!»
------------------------------------------------------------------------------------------------------
"""
# i = []
# while True:
#     x = int(input("число: "))
#     i.append(x)
#     if x == 7:
#         print("Good bye!")
#         break
#
#     print(f"введенные числа {i}")
#     print(f"сумма {sum(i)}")
#     print(f"max {max(i)}")
#     print(f"min {min(i)}")

"""
--------------------------------------------------------------------------------------------------
Задание 6
Напишите функцию,которая проверяет является ли число простым.Число передаётся в качестве параметра. 
Если число простое нужно вернуть из метода true,иначе false.

(Просто́е число́ — это натуральное число, большее единицы, имеющее ровно два натуральных делителя:
1 и само себя)
----------------------------------------------------------------------------------------------------
"""
# z = []
#
# for j in range(2, 1000):
#     i = 0
#     count = 0
#
#     while i < j:
#         i += 1
#         if j % i == 0:
#             count += 1
#     if count == 2:
#         z.append(j)
#
# # print(count, end=" ")
# print()
# print(z)
# print(len(z))

"""
--------------------------------------------------------------------------------
Напишите программу, которая считывает со стандартного ввода целые числа, 
по одному числу в строке, и после первого введенного нуля выводит сумму 
полученных на вход чисел.
------------------------------------------------------------------------------
"""
# x = 0
# while True:
#     num = int(input("введите число: "))
#     x += num
#     if num == 0:
#         break
#
# print(f"подсчёт окончен сумма чисе = {x}")

"""
---------------------------------------------------------------------------------------
в институте биоинформатики между информатиками и биологами устраивается соревнование. 
Победителям соревнования достанется большой и вкусный пирог. в команде биологов "а" 
человек, в команде информатиков "в", нужно заранее разрезать пирог таким образом чтобы 
можно было раздать кусочки пирога любой команде выигравшей соревнование, при этом каждому 
участнику этой команды должно достаться одинаковое количество пирога.
----------------------------------------------------------------------------------------
"""
# a = int(input("введите количество 1 команды: "))
# b = int(input("введите количество 2 команды: "))
#
# d = 1
# while d % a != 0 or d % b != 0:
#     d += 1
# print(f"общее количество кусочков - {d}")

"""
------------------------------------------------------------------------------------
напишите программу которая считывает целые числа с консоли по одному числу в строке
для каждого введённого числа проверить если число меньше 10, то пропускаем это число
если число больше 100, то прекращаем считывать числа в остальных случаях вывести это 
число обратно на консоль в отдельной строке
------------------------------------------------------------------------------------
"""
# while True:
#     num = int(input("введите число: "))
#     if num < 10:
#         continue
#     if num > 100:
#         break
#     print(num)

"""
---------------------------------------------------------------------------------
Обратный отсчет.Создайте программу, которая делает обратный отсчет от заданного
пользователем числа до нуля.
---------------------------------------------------------------------------------
"""
# s = int(input("введите число: "))
# x = 0
# z = []
# while s > x:
#     s -= 1
#     z.append(s)
# print(z)










