"""
------------------------------------------------------------------------------------------------
словарь
--------------------------------------в списках значения хранятся по идексу, в словаре по ключам
создание словаря ключ, значение, добавление и т.д.
-------------------------------------------------------------------------------------------------
"""
# # способ создания словаря
# d1_1 = {}
# d2_1 = dict()
# d3_1 = dict.fromkeys("1")
#
# d1 = {"a": 7} # первый способ d1_1 = {}
# print(d1)
# print(d1["a"])
# d1["b"] = 9 # добавили значение
# print(d1)
# d1["a"] = 9 # заменили значение
# print(d1)
# del d1["a"] # удаление элемента
# print(d1)
#
# d2 = dict(a = 7) # второй способ d2_1 = dict()
# print(d2)
# d2 = dict([["a", 2],["b", 3]])
# print(d2)


#
# d3 = dict.fromkeys([1, 2, 3, 4]) # третий способ d3_1 = dict.fromkeys("1")
# print(d3) #получается без значений (просто ключи)
# d3 = dict.fromkeys([1, 2, 3, 4], "value")
# print(d3) #добавили значение

"""
--------------------------------------------------------------------------------------------------
словарь
прайс пример использования
--------------------------------------------------------------------------------------------------
"""
# в списках значения хранятся по идексу, в словаре по ключам
# price = {"meat": 3, "bread": 1, "potato": 0.5, "water": 0.2}
#
# def byu():
#     pay = 0
#     while True:
#         enter = input("что покупаем???\n")
#         if enter == "end":
#             break
#         pay += price[enter]
#     return pay
#
# print(byu())


"""
-----------------------------------------------------------------------------------------------
словарь
обращение
-----------------------------------------------------------------------------------------------
"""
# users = {
#     "Alex7": {"password": 9856214, "id": 1957},
#     "Jimmy99": {"password": 1236487, "id": 9654},
#     "Bob33": {"password": 9546752, "id": 6453},
# }
#
# print(users["Alex7"]["password"])
# print(users["Alex7"]["id"])

"""
-----------------------------------------------------------------------------------------------
словарь
методы
-----------------------------------------------------------------------------------------------
"""
# d = {"a": 7,"b": 9 }
# d_d = dict([["a1", 2],["b2", 3]])
# print(d.items()) # возвращает список состоящий из пары значений
# print(d.keys()) # возвращает список состоящий из ключей
# print(d.values()) # возвращает список состоящий из pyfxtybq
# d.update(d_d)
# print(d_d)

# t = d.pop("a") #удалили зачение и сохранили в переменную
# print(t, d)

