
"""
-----------------------------------------------------------------------------
1. Создание и вывод кортежа
Создайте кортеж с несколькими элементами и выведите его на экран.
------------------------------------------------------------------------------
"""
print(f"\nСоздание кортежа")

x = (1, 2, 3, 4, 5)
print(x)

y = tuple("12345")
print(y)

z = (9,)
print(f"кортеж из одного элемента {z}")

"""
--------------------------------------------------------------------------------
2. Доступ к элементам кортежа
Выведите второй элемент кортежа.
--------------------------------------------------------------------------------
"""
print(f"\nВторой элемент кортежа")

print(x[2])

print(y[2])

"""
-------------------------------------------------------------------------------
3. Изменение кортежа (непрямое изменение)
Кортежи неизменяемы, но вы можете создать новый кортеж на основе существующего.
-------------------------------------------------------------------------------
"""
print(f"\nИзменение кортежа")
#--------------------------------------------------------------------- цикл
print("через цикл")
x3 = (1,2,3,4,5,6,7,8,9,10)
print(x3)

y3 = []
for i in range(len(x3)):
    y3.append(x3[i] + 3)

x3 = tuple(y3)
print(x3)
#--------------------------------------------------------------------- список
print("через список")
x3_1 = (1,2,3,4,5,6,7,8,9,10)
print(x3_1)
y3_1 = list(x3_1)
y3_1[0] = 10
x3_1 = tuple(y3_1)
print(x3_1)

"""
--------------------------------------------------------------------------------
4. Поиск максимального и минимального значения
Создайте кортеж с числами и найдите максимальное и минимальное значение.
--------------------------------------------------------------------------------
"""
print(f"\nПоиск максимального и минимального значения")

x4 = (1,2,3,4,5,6,7,8,9,10)
print(x4)

print(f"максимальное {max(x4)}")
print(f"минимальное {min(x4)}")

"""
----------------------------------------------------------------------------------
5. Сложение элементов кортежа
Создайте кортеж с числами и найдите их сумму.
----------------------------------------------------------------------------------
"""
print(f"\nСложение элементов")

x5 = (1,2,3,4,5,6,7,8,9,10)
print(x5)

print(f"сумма - {sum(x5)}")

"""
---------------------------------------------------------------------------------
6. Объединение кортежей
Создайте два кортежа и объедините их в один.
---------------------------------------------------------------------------------
"""
print(f"\nОбъединение кортежей")

x6 = (1,2,3,4)
print(f"кортеж 1 - {x6}")

x6_1 = (5,6,7,8)
print(f"кортеж 2 - {x6_1}")

x6 += x6_1
print(f"кортеж 1 объединённый - {x6}")

"""
--------------------------------------------------------------------------------
7. Преобразование списка в кортеж
Создайте список и преобразуйте его в кортеж.
--------------------------------------------------------------------------------
"""
print(f"\nПреобразование списка в кортеж")

print("списки:")
x7 = [1,2,3,4,5,6,7,8,9,10]
print(x7)
x7_1 = ["python"]
print(x7_1)

print("кортежи:")
x7 = tuple(x7)
print(x7)
x7_1 = tuple(x7_1)
print(x7_1)

"""
--------------------------------------------------------------------------------
8. Проверка наличия элемента в кортеже
Проверьте, есть ли определенный элемент в кортеже.
-------------------------------------------------------------------------------
"""
print(f"\nПроверка наличия элемента в кортеже")

x8 = (1,2,3,4,5,6,7,8,9,10)
print(f"кортеж {x8}")
y8 = []

for i in x8:
    if i == 5:
        y8.append(i)

print(f"искомый элемент в кортеже {tuple(y8)}")

"""
----------------------------------------------------------------------------------
9. Разупаковка кортежа
Разупакуйте элементы кортежа в отдельные переменные.
----------------------------------------------------------------------------------
"""
print(f"\nРазупаковка кортежа")

x9 = (1,2,3,4,5,6,7,8,9,10)
print(f"кортеж {x9}")

print(f"отдельные элементы кортежа: ")
for i in x9:
    print(i, end=" ")

