"""
==================================================================================================
--Задача 1: Создание таблицы пользователей
--
--Создайте таблицу users, которая будет хранить информацию о пользователях.
    Таблица должна содержать следующие поля:
--• id (целое число, первичный ключ, автоинкремент)
--• username (строка, уникальное значение)
--• email (строка, уникальное значение)
--• password (строка)
--• created_at (дата и время создания записи)

_____________________________________________________________
CREATE TABLE homework_2.users (
   id BIGINT PRIMARY KEY GENERATED ALWAYS AS IDENTITY,
   username VARCHAR(50) UNIQUE,
   email VARCHAR(100) UNIQUE,
   password VARCHAR(100),
   created_at DATE
);

select * from homework_2.users;
===================================================================================================
***************************************************************************************************
===================================================================================================
--Задача 2: Создание таблицы продуктов
--
--Создайте таблицу products, которая будет хранить информацию о продуктах в интернет-магазине. 
--Таблица должна содержать следующие поля:
--• id (целое число, первичный ключ, автоинкремент)
--• name (строка, название продукта)
--• description (текст, описание продукта)
--• price (десятичное число, цена продукта)
--• stock_quantity (целое число, количество на складе)
--• created_at (дата и время создания записи)

CREATE TABLE homework_2.products (
   id BIGINT PRIMARY KEY GENERATED ALWAYS AS IDENTITY,
   name VARCHAR(50),
   description VARCHAR(200),
   price NUMERIC,
   stock_quantity INTEGER,
   created_at DATE
);

select * from homework_2.products;
====================================================================================================
***************************************************************************************************
====================================================================================================
Задача 3: Создание таблицы заказов

Создайте таблицу orders, которая будет хранить информацию о заказах. 
Таблица должна содержать следующие поля:
• id (целое число, первичный ключ, автоинкремент)
• user_id (целое число, внешний ключ на таблицу users)
• total_amount (десятичное число, общая сумма заказа)
• order_date (дата и время заказа)
• status (строка, статус заказа, например: 'pending', 'completed', 'canceled')

_______________________________________________________________________________________________
CREATE TABLE homework_2.orders (
   id BIGINT PRIMARY KEY GENERATED ALWAYS AS IDENTITY,
   user_id INTEGER,
   total_amount NUMERIC,
   order_date DATE,
   status text
   CHECK (status IN ('pending', 'completed', 'canceled')),
   FOREIGN KEY (user_id) REFERENCES users(id)
);
======================================================================================
**************************************************************************************
======================================================================================
Задача 4: Создание таблицы отзывов

Создайте таблицу reviews, которая будет хранить отзывы пользователей о продуктах. Таблица должна содержать следующие поля:
• id (целое число, первичный ключ, автоинкремент)
• product_id (целое число, внешний ключ на таблицу products)
• user_id (целое число, внешний ключ на таблицу users)
• rating (целое число, оценка от 1 до 5)
• comment (текст, комментарий пользователя)
• created_at (дата и время создания записи)

_________________________________________________________
CREATE TABLE homework_2.reviews (
   id BIGINT PRIMARY KEY GENERATED ALWAYS AS IDENTITY,
   product_id INTEGER,   
   user_id INTEGER,
   rating INTEGER
   CHECK (rating IN (1, 2, 3, 4, 5)),
   comment TEXT,
   created_at DATE,   
   FOREIGN KEY (user_id) REFERENCES users (id),
   FOREIGN KEY (product_id) REFERENCES products (id)   
);
==========================================================================
**************************************************************************
==========================================================================
Задача 5: Создание таблицы категорий

Создайте таблицу categories, которая будет хранить категории продуктов. 
Таблица должна содержать следующие поля:
• id (целое число, первичный ключ, автоинкремент)
• name (строка, название категории)
• description (текст, описание категории)

________________________________________________
CREATE TABLE homework_2.categories (
   id BIGINT PRIMARY KEY GENERATED ALWAYS AS IDENTITY,
   name VARCHAR(50),
   description TEXT
);
=====================================================================================
***********************************************************************************
====================================================================================
Задача 6: Связь между продуктами и категориями

Добавьте в таблицу products поле для хранения связи с категориями. Это может быть поле:
• category_id (целое число, внешний ключ на таблицу categories).







"""






















